app/controllers/cages_controller.rb

  def create
    @cage = Cage.new(cage_params)

    if @cage.save
---
INSERT INTO "cages" ("capacity", "aasm_state", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["capacity", 1], ["aasm_state", "active"], ["created_at", "2015-07-01 07:16:25.329780"], ["updated_at", "2015-07-01 07:16:25.329780"]]

  def update
    @cage = Cage.find(params[:id])

    if @cage.update(cage_params)
---
SELECT  "cages".* FROM "cages" WHERE "cages"."id" = ? LIMIT 1  [["id", 2]]
UPDATE "cages" SET "capacity" = ?, "updated_at" = ? WHERE "cages"."id" = ?  [["capacity", 99], ["updated_at", "2015-07-01 07:15:14.003998"], ["id", 2]]

  def power_down
    @cage = Cage.find(params[:id])
---
SELECT  "cages".* FROM "cages" WHERE "cages"."id" = ? LIMIT 1  [["id", 2]]

  def destroy
    @cage.destroy
---
DELETE FROM "cages" WHERE "cages"."id" = ?  [["id", 2]]

    def set_cage
      @cage = Cage.find(params[:id])
---
SELECT  "cages".* FROM "cages" WHERE "cages"."id" = ? LIMIT 1  [["id", 2]]