app/controllers/dinos_controller.rb

  def create
    @dino = Dino.new(dino_params)

    if @dino.save
---
INSERT INTO "dinos" ("name", "species_id", "cage_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["name", "RuPaul"], ["species_id", 1], ["cage_id", 1], ["created_at", "2015-07-01 05:26:56.211743"], ["updated_at", "2015-07-01 05:26:56.211743"]]

  def update
    @dino = Dino.find(params[:id])

    if @dino.update(dino_params)
---
SELECT  "dinos".* FROM "dinos" WHERE "dinos"."id" = ? LIMIT 1  [["id", 1]]
UPDATE "dinos" SET "name" = ?, "updated_at" = ? WHERE "dinos"."id" = ?  [["name", "Charles"], ["updated_at", "2015-07-01 05:44:02.812341"], ["id", 1]]

  def destroy
    @dino.destroy
---
DELETE FROM "dinos" WHERE "dinos"."id" = ?  [["id", 1]]

    def set_dino
      @dino = Dino.find(params[:id])
---
SELECT  "dinos".* FROM "dinos" WHERE "dinos"."id" = ? LIMIT 1  [["id", 1]]