app/controllers/species_controller.rb

  def create
    @species = Species.new(species_params)

    if @species.save
---
INSERT INTO "species" ("name", "diet", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["name", "#DadBod"], ["diet", 0], ["created_at", "2015-07-01 07:58:36.237786"], ["updated_at", "2015-07-01 07:58:36.237786"]]

  def update
    @species = Species.find(params[:id])

    if @species.update(species_params)
---
SELECT  "species".* FROM "species" WHERE "species"."id" = ? LIMIT 1  [["id", 1]]
UPDATE "species" SET "diet" = ?, "updated_at" = ? WHERE "species"."id" = ?  [["diet", 0], ["updated_at", "2015-07-01 07:54:02.668767"], ["id", 1]]

  def destroy
    @species.destroy
---
DELETE FROM "species" WHERE "species"."id" = ?  [["id", 1]]

    def set_species
      @species = Species.find(params[:id])
---
SELECT  "species".* FROM "species" WHERE "species"."id" = ? LIMIT 1  [["id", 1]]